[{"slug":"a-year-in-the-garden","title":"A Year in the Garden","date":1643173938217,"synopsis":"The Garden and the Stream: A Technopastoral. Opening keynote for dLRN 2015. Delivered October 16th @ Stanford. Mike Caulfield. [http://hapgood.us/2015/10/17/the-garden-and-the-stream-a-technopastoral/ post]","links":{"gardens-and-streams":"4cb9c52c264f3a43"}},{"slug":"against-the-rules-podcast","title":"Against The Rules Podcast","date":1650257961398,"synopsis":"Michael","links":{"six-levels-down":"28556000"}},{"slug":"basics-of-adaptive-failure","title":"Basics of Adaptive Failure","date":1643744389152,"synopsis":"Basic patterns in how adaptive systems fail. David Woods. 2011. Three ways adaptive systems fail: (1) decompensation—exhaust capacity to adapt as challenges cascade; (2) work at cross-purposes—locally adaptive behaviour is globally mal-adaptive; and (3) getting stuck in outdated behaviours—over-reliance on past successes. A working organisation need abilities to detect these three adaptive traps as they approach and needs abilities to act to avoid or escape them. Detecting these traps requires contrasting diverse perspectives. [https://www.researchgate.n"},{"slug":"better-writer-in-tech","title":"Better Writer in Tech","date":1644009375636,"synopsis":"Extending influence as one matures in engineering demands ability to communicate ideas clearly. Sharpen your writing skills. Becoming a Better Writer in Tech. Gergely Orosz. [https://blog.pragmaticengineer.com/becoming-a-better-writer-in-tech/ article]"},{"slug":"commonplace-book","title":"Commonplace Book","date":1643206258242,"synopsis":"Commonplace books were originally the preserve of male scholars who used them to keep notes as they learned; but gradually their use spread beyond universities and by the 18th century commonplace books were also used by educated women. The problem wasn't in the collecting, but the finding again. Kathryn Kane writes about English cultural history in the Regency period covered the development of the commonplace book quite thoroughly. [http://regencyredingote.wordpress.com/2013/11/22/salads-of-many-herbs-zibaldone-in-the-regency/ link]","links":{"zettelkasten":"f6d59e0f7aee0734","leonardos-method":"f6d59e0f7aee0734","general-inductive-analysis":"ee7a139c4b2825aa"}},{"slug":"crdt-for-rich-text-collaboration","title":"CRDT for Rich-Text Collaboration","date":1643493203845,"synopsis":"Peritext—A CRDT for Rich-Text Collaboration by Ink and Switch. Sometimes people prefer a more asynchronous collaboration style, where they can work on a private copy of a document for a while and share their updates later. The algorithms underpinning services like Google Docs are not designed to support this use case. ... Despite limitations, Peritext is an important step towards asynchronous collaboration for rich text. [https://www.inkandswitch.com/peritext/ article]"},{"slug":"crucial-complexity","title":"Crucial Complexity","date":1649136013174,"synopsis":"Complexity: The Crucial Ingredient in Your Kitchen. Casey Rosenthal. SRECon 2019 [https://www.usenix.org/conference/srecon19americas/presentation/rosenthal usenix] [https://www.youtube.com/watch?v=mvVfjYE1olc youtube]"},{"slug":"design-and-reality","title":"Design and Reality","date":1649111290897,"synopsis":"Mathias Verraes and Rebecca Wirfs-Brock describe a design breakthrough in \"Design and Reality: Reframing the problem through design\". Rebecca was invited to consult for a company that makes hardware and software for oil rigs. The initial model assumed alarms are directly connected to emergency conditions in the world. The system’s perception of the world is distorted: when engineers turn off the alarm, the system believes the emergency is over. But it’s not, turning an alarm off doesn’t change the emergency condition in the world. ... the team discovered","links":{"story-of-advancers":"e784592528a8e4e1"}},{"slug":"drawing-dynamic-models","title":"Drawing Dynamic Models","date":1648673439785,"synopsis":"Crosscut is a stylus & tablet tool for drawing dynamic models of your thoughts. It aspires to be a thing to think through. In Crosscut you sketch, cobble, tinker, and play toward a deeper understanding. Begin by using the drawing tools to sketch something you’re thinking about, as you would with pen & paper. Then, add dynamic behaviors with a programming system that lives right inside your sketches. Each dynamic sketch is a reusable part that you can nest inside other sketches, enabling you to build elaborate models from simple pieces. Ink & Switch. Cros"},{"slug":"eric-dobbs","title":"Eric Dobbs","date":1647796189794,"synopsis":"I wander through many news streams on The 'Net in my daily life. In this wiki I collect insights that capture my attention or ask to be remembered. See [[Commonplace Book]].","links":{"commonplace-book":"4870a57500933370"}},{"slug":"general-inductive-analysis","title":"General Inductive Analysis","date":1647454451330,"synopsis":"A General Inductive Approach for Analyzing Qualitative Evaluation Data, David R. Thomas, University of Auckland. The collection of qualitative data in evaluation is common. However, knowledge about strategies for efficient and defendable procedures for analyzing qualitative data is less common. A general inductive approach for analysis is described. [https://www.researchgate.net/publication/224029397_A_General_Inductive_Approach_for_Analyzing_Qualitative_Evaluation_Data researchgate]","links":{"thematic-analysis":"30ec7967e4556564","commonplace-book":"3b8049e21f183dc0","zettelkasten":"3b8049e21f183dc0","leonardos-method":"8874c9dc819fd4c5"}},{"slug":"incident-response-at-slack","title":"Incident Response at Slack","date":1644956150453,"synopsis":"Evolution of Incident Management at Slack. Brent Chapman @ SRECon2021. Learn how we've made incident management a core capability of everyone on our engineering team: where we are, how we got here, and where we're going. Brent has basically given everyone a roadmap to building an effective incident response program. [https://www.usenix.org/conference/srecon21/presentation/chapman usenix] [https://www.usenix.org/system/files/srecon21_slides_chapman.pdf pdf] [https://www.youtube.com/watch?v=FYYTglQoS3w youtube]","links":{"who-owns-on-call":"a37575c511ce799e"}},{"slug":"kat-nouri--stasher","title":"Kat Nouri & Stasher","date":1650235173287,"synopsis":"As a mother of three, Kat Nouri was dismayed at the amount of "},{"slug":"on-the-brittleness-of-dashboards","title":"On the Brittleness of Dashboards","date":1647452523498,"synopsis":"Dashboards are one of the most basic and popular tools software engineers use to operate their systems. In this post, I'll make the argument that their use is unfortunately too widespread, and that the reflex we have to use and rely on them tends to drown out better, more adapted approaches, particularly in the context of incidents. On the brittleness of dashboards. Fred Hebert. [https://www.honeycomb.io/blog/brittleness-of-dashboards/ article]"},{"slug":"scratch","title":"Scratch","date":1650241352321,"synopsis":"A page with 0 items."},{"slug":"shadows-of-software-design","title":"Shadows of Software Design","date":1647320103352,"synopsis":"Software design is intertwingled shadows. A better metaphor than an iron triangle."},{"slug":"six-levels-down","title":"Six Levels Down","date":1650258018597,"synopsis":"Todd Park, tech entrepreneur, was looking to improve prenatal care. Athenahealth. Raised millions of dollars to buy a healthcare clinic in San Diego as a proof of concept. Bob Gatewood was hired. They couldn't get insurance companies to pay them. It became a cause. We must save this practice 'cos we're the social safety net for San Diego County. They had to solve this surprising problem of getting paid by insurance companies. They needed an expert. [https://www.pushkin.fm/episode/six-levels-down/ podcast]","links":{"against-the-rules-podcast":"27411062d41ef535"}},{"slug":"software-provenance","title":"Software Provenance","date":1647317728149,"synopsis":"in-toto is a system for securing the way in which software is developed, built, tested, and packaged (i.e., the software supply chain). in-toto attests to the integrity and verifiability of all the actions performed while writing code, compiling, testing, and deploying software. It does so by making it transparent to the user what steps were performed, by whom and in what order. As a result, given guidance by the group creating the software, in-toto allows the user to verify if a step in the supply chain was intended to be performed, if the step was perf"},{"slug":"story-of-advancers","title":"Story of Advancers","date":1648251434297,"synopsis":"Brian Marick says, I'm especially interested in the stories that peers tell each other to reinforce a style of working and body of practical knowledge. Ward's story of \"method object\" is a good example. [http://www.exampler.com/old-blog/2004/08/11/index.html#advancers post]","links":{"how-we-learn-to-program":"e97fde28a14a9d17","salience-network":"a3c54dd9fe29fa4a","design-and-reality":"e784592528a8e4e1"}},{"slug":"the-water-we-swim-in","title":"The Water We Swim In","date":1652457901123,"synopsis":"The water we swim in: why the hardest problems in DevOps are difficult to see and talk about. Dr. Laura Maguire @ DevOpsDays Rockies 2022 [https://www.youtube-nocookie.com/embed/n3DvKmqhzUo?start=6472&end=8386 youtube]"},{"slug":"thematic-analysis","title":"Thematic Analysis","date":1647454422974,"synopsis":"Identifying the main themes in data from user studies — such as: interviews, focus groups, diary studies, and field studies — is often done through thematic analysis. Thematic analysis is a systematic method of breaking down and organizing rich data from qualitative research by tagging individual observations and quotations with appropriate codes, to facilitate the discovery of significant themes. Themes describe a belief, practice, need, or another phenomenon that is discovered from the data. They","links":{"general-inductive-analysis":"02c9f83791f89b62","commonplace-book":"a09fb20157be6006"}},{"slug":"tiny-habits","title":"Tiny Habits","date":1643137881092,"synopsis":"Stanford professor B.J.Fogg suggests lasting behavior change grows from many tiny habits."},{"slug":"towards-operational-excellence","title":"Towards Operational Excellence","date":1644009095900,"synopsis":"Towards Operational Excellence: Part 3—Mechanisms. Adrian Hornsby.  Good intentions don't work. Mechanisms do. [https://medium.com/the-cloud-architect/towards-operational-excellence-part-3-8b727f06a4b6 medium]"},{"slug":"usefulness-of-error","title":"Usefulness of Error","date":1647030692806,"synopsis":"\"Error\" serves a number of functions for an organization: as a defense against entanglement, the illusion of control, as a means for distancing, and as a marker for a failed investigation. \"Those found responsible have been sacked\": some observations on the usefulness of error. Richard I. Cook, Christopher P. Nemeth. [https://www.researchgate.net/publication/220579378_Those_found_responsible_have_been_sacked_Some_observations_on_the_usefulness_of_error researchgate]"},{"slug":"wander","title":"Wander","date":1649111749401,"synopsis":"Wander. Make note of surprises along the way.","links":{"tiny-habits":"59e60207baa5287f","a-year-in-the-garden":"e68d03a4fa79d872","commonplace-book":"52a0f743846f8be9"}},{"slug":"weak-signals--chaos","title":"Weak Signals & Chaos","date":1643493076693,"synopsis":"Actively searching for and understanding Weak Signals is the key to creating the most productive Chaos Experiments. Weak Signals are small, barely noticeable, indications of new emergent behavior in the system. They’re the “tea leaves”, they trigger our gut feelings, and our hunches. Signs, Signs, Everywhere a Sign. Andy Fleener. GOTO 2021 [https://speakerdeck.com/anfleene/sign-sign-everywhere-a-sign-what-five-man-electrical-band-and-todd-conklin-taught-me-about-chaos-engineering slides] [https://www.youtube.com/watch?v=VNiWLKS4IqQ youtube]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1643741356538,"synopsis":"Welcome to this [[Federated Wiki]] site. From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own site to participate.","links":{"federated-wiki":"7b56f22a4b9ee974","eric-dobbs":"63ad2e58eecdd9e5","wander":"05e2fa92643677ca","how-to-wiki":"ee416d431ebf4fb4","recent-changes":"ee416d431ebf4fb4"}},{"slug":"what-is-incident-analysis","title":"What is Incident Analysis?","date":1644009916752,"synopsis":"What is incident analysis and why should we do it? Dr. Laura Maguire & Vanessa Huerta Ganda kick off a series to introduce incident analysis. [https://www.jeli.io/what-is-incident-analysis-and-why-should-we-do-it/ page]"},{"slug":"who-owns-on-call","title":"Who Owns On-Call?","date":1644954666597,"synopsis":"Industry leaders like Google, Amazon, Dropbox, Spotify, and Netflix are putting developers on-call for their software. We spoke to these companies to find out why. (Increment issue 1. April 2017. Published by Stripe) [https://increment.com/on-call/who-owns-on-call/ article]","links":{"incident-response-at-slack":"093be0415459e1b1"}},{"slug":"queue-depth-grows","title":"Queue Depth Grows","date":1653750560024,"synopsis":"One of the most desirable properties in queue or stream based systems is increased efficiency as the queue depth grows. Without that property, slight mode shifts can push the system into the state of perpetually growing backlog. [https://twitter.com/_joemag_/status/1511027555813318658 tweet]"}]